IDENTIFICATION DIVISION.
       PROGRAM-ID. ArrayExemplo.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  MEU-ARRAY.
           05 NUMERO PIC 9 VALUE 0 OCCURS 3 TIMES.
       
       PROCEDURE DIVISION.
           MOVE 1 TO NUMERO(1).
           MOVE 2 TO NUMERO(2).
           MOVE 3 TO NUMERO(3).
           DISPLAY NUMERO(1).
           STOP RUN.